# Задача 1.3

Задан массив целых чисел. Необходимо переставить наименьшее из этих чисел в начало массива, а наибольшее - в конец.

Массивы в Java определяются с помощью указания их размера в квадратных скобках:

`int[] v = new int[77];`

Размер можно не указывать, но тогда нужно определить сами элементы в фигурных скобках:

`int[] v = new int[] {6, 28, 1};`

Обращаться к элементам можно по индексу:

`System.out.println(v[0]); // выводим первый по счету элемент`

`v[1] = 16; // изменяем значение элемента с индексом 1`

Размер массива:

`v.length;`

## Входные данные:
Элементы массива, по очереди через пробел. Без экранирующих символов и обозначений начала и конца массива.

## Тестовые данные:

|Исходный массив|Результирующий массив|
|---|--:|
|[6, 28, 1, 17]|[1, 17, 6, 28]|
|[6, 28, 17, 1]|[1, 6, 17, 28]|
|[1, 17, 6, 28]|[1, 17, 6, 28]|
|[28, 6, 17, 1]|[1, 6, 17, 28]|
|[28, 5, 11, 1, 44, 17, 8]|[1, 5, 11, 28, 8, 17, 44]|

